modules/editing/freemacs-yasnippet.org
# -*-eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t);-*-

#+title: YASnippet Configuration
#+author: Thomas Freeman
#+date: Time-stamp: <2024-12-13 17:43:14 thomas>
#+language: en_US
#+property: header-args :results silent :exports code

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t num:nil toc:t
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+keywords: Emacs
#+html_link_home: ../../index.html
#+html_link_up: ../../init.html
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+html_head: <style>#org-div-home-and-up { text-align: right; padding-right: 10pt; }</style>

#+SETUPFILE: https://tfree87.github.io/org-html-themes/org/theme-readtheorg.setup
-----


* Install YASnippet

[[https://github.com/joaotavora/yasnippet][YASnippet]] takes a small bit of text or an abbreviation and expands it into a template once the ~<TAB>~ key has been pressed. 
#+begin_src emacs-lisp :tangle yes :comments org
  (use-package yasnippet
    :straight t
    :defer t
    :hook
    (org-mode . yas-minor-mode)
    (prog-mode . yas-minor-mode))
#+end_src

** Install Snippets

The package [[https://github.com/AndreaCrotti/yasnippet-snippets][YASnippet Snippets]] loads many pre-defined templates for YASnippet.
#+begin_src emacs-lisp :tangle yes :comments org
  (use-package yasnippet-snippets
    :straight t
    :after yasnippet
    :defer t)
#+end_src

* End

Tell Emacs what package this file provides.
#+begin_src emacs-lisp :tangle yes :comments org
  (provide 'freemacs-yasnippet)

  ;;; freemacs-editing.el ends here
#+end_src
